Reports/ОтчетРасхождениеДанныхСкладаИФинСлужбы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетРасхождениеДанныхСкладаИФинСлужбы</Name>
		</Properties>
	</Report>
</MetaDataObject>

Enums/ВидыОперацийРасходСкладскойУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСкладскойУчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВТорговуюТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТехнологу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОборудованияВТорговуюТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВСебестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаНуждыСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеОтходовОтПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утилизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтилизацияБой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаПитаниеСотрудниковСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОтчетРасхождениеДанныхСкладаИФинСлужбы/Forms/УтверждениеДокументов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивДокументы") Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("МассивДокументы", Параметры.МассивДокументы);
		Запрос.УстановитьПараметр("ВидОперации", Параметры.МассивДокументы);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РасходныйОрдерСклад.Ссылка
		               |ИЗ
		               |	Документ.РасходныйОрдерСклад КАК РасходныйОрдерСклад
		               |ГДЕ
		               |	РасходныйОрдерСклад.Ссылка В(&МассивДокументы)
		               |	И РасходныйОрдерСклад.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСкладскойУчет.ОтгрузкаТехнологу), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСкладскойУчет.СписаниеВСебестоимость), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСкладскойУчет.СписаниеНаНуждыСклада), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСкладскойУчет.СписаниеОтходовОтПереработки), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСкладскойУчет.Утилизация), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходСкладскойУчет.УтилизацияБой))
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	РасходныйОрдерСклад.Дата";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаДоб = ДокументыКУтверждению.Добавить();
			СтрокаДоб.Утвердить = Истина;
			СтрокаДоб.Документ = Выборка.Ссылка;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаб Из ДокументыКУтверждению Цикл
		СтрокаТаб.Утвердить = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаб Из ДокументыКУтверждению Цикл
		СтрокаТаб.Утвердить = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуУтверждения(Команда)
	
	Дата = ТекущаяДата();
	Если ВвестиДату(Дата, "Укажите дату утверждения документов", ЧастиДаты.Дата) Тогда
		Для Каждого СтрокаТаб Из ДокументыКУтверждению Цикл
			Если СтрокаТаб.Утвердить Тогда
				СтрокаТаб.ДатаУтверждения = Дата;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УтвердитьНаСервере()
	
	Для Каждого СтрокаТаб Из ДокументыКУтверждению Цикл
		Если СтрокаТаб.Утвердить Тогда
			ДокОб = СтрокаТаб.Документ.ПолучитьОбъект();
			ДокОб.ПризкакПодтвержденияВФинУчете = Истина;
			ДокОб.ДатаОтраженияВФинУчете = ?(ЗначениеЗаполнено(СтрокаТаб.ДатаУтверждения), СтрокаТаб.ДатаУтверждения, ДокОб.Дата);
			ДокОб.ДополнительныеСвойства.Вставить("ОтложенноеПроведение", Истина);
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Утвердить(Команда)
	УтвердитьНаСервере();
	Закрыть();
КонецПроцедуры
